body_text.org
#+TITLE:     Background and concepts for monitoring survey progress and scheduler performance
#+AUTHOR:    Eric H. Neilsen, Jr.
#+EMAIL:     neilsen@fnal.gov
#+LANGUAGE:  en
#+OPTIONS:   H:2 toc:nil num:2 \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+EXPORT_EXCLUDE_TAGS: noexport
#+TODO: TODO(t) ACTIVE(a) PAUSED(p) WAITING(w) | MAYBE(m) LATER(l) DONE(d) ABANDONED(b)

* Instructions                                                     :noexport:
To export so that it will be processed by the LSST Latex makefile:

In org-mode:
C-c C-e to get the Export Dispatecher buffer
then C-b to configue it to export just the content,
and not create its own latex preamble (class declaration, etc.)
then l l (two lower-case "L"s) to export the result to body_text.tex

* Summary
 - Tracking survey progress, comparison of the actual progress both to a baseline and to what would have been expected under similar conditions (e.g. weather) is important for Rubin Observatory staff and management, the science collaborations, the astronomical community, funding agencies, and even the general public.
 - Survey progress and strategy diagnostics will need to be presented in multiple contexts, to a variety of audiences. 
 - Data useful for evaluating survey progress and optomizing strategy is best visualized in a variety of ways. Some useful metrics are best viewed as scalars, or a simple time series. In other cases, complex plots or diagrams are required, and even then such plots may only be effectively interpreted in combination with other plots, diagrams, or descriptive text.
 - Some metrics and visualizations needed for evaluating survey progress and optomizing strategy is "close to the data," and require minimal processing before presentation to the user. In other cases, however, significant analysis is necessary (for example suites of scheduler simulations). This diversity complicates infrastructure requirements.
 - Generation of survey progress and strategy diagnostics requires both data generated "close to the instrument" (telemetry from the telescope) and data only available from other sources such as the output of processing by Data Management and the results of strategy simulations.
 - Rubin Observatory infrastructure currently under development (including opsim, MAF, SQuaRE/SQuaSH, LOVE, the Engineering and Facilities Database (EFD), and the Data Management butler) provides or will provide an array data sources and visualzation tools. It is not always clear, however, which tools are a good match for which strategy and progress related metrics, and work is required take advantage of this existing infrastructure.
* TODO Introduction
* ACTIVE Tools, reports and their audiences
** Introduction
The Rubin Observatory project and staff performing LSST will require survey progress and status diagnostics, including a variety of metrics and plots.
Some of these will be needed by the staff themselves, providing the data needed to prevent and diagnose problems, identify potential imporvements, and evaluate suggestions for changes.
In addition, such plots and metrics will also be needed for reports to the astronomical community and funding agencies, and even may be useful in engaging the general public.

The infrastructure suitable for producing such plots and metrics depend of several factors, including the audience expected to make use of them and the frequency with which they need to be produced.
Full automation of the production of plots and metrics will be most important when they need to be produced frequently, on a nightly or monthly basis.
When their audience includes non-experts, either full automation or simple production on demand will save effort.
Plots that are used primarily for debugging or exploration of specific issues may not require the same level of automation or simplicty of interface, but tools for reproduction of previous example of such diagnostics can be important for avoiding duplication of effort.

These plots and metrics can be produced and presented in any of several ways:

 - Interactive tools :: When developing and debugging the software, hardware, and human procedures that produce the survey, experts working on the project require flexible tools to obtain and explore the relevant data. Planning and prediction of the consequences of events and choices will often benefit creation of simulations. Examples of such sets of tools (e.g. =opsim= and =MAF=) have been developed as part of project construction, and will continue to perform an important role in operations. General tools designed for monitoring other aspects of the survey (e.g. the health of the instrument or the status of data processing) will also have important roles to play. 
 - Information dashboards :: Some plots and metrics will routine production and monitoring, often by those who are not expert users of the interactive tools like =MAF=. Even for those who do have the expertise, automation of the production of routine plots and metrics will save significant effort. Infrastructure that generates needed plots and metrics and presents them in a simple way (e.g. an automatically update web page, or small collection of web pages) will therefore be important. This infrastructure will require many of the same software components used by the interactive tools, plus some automation and presetation elements. 
 - Reports :: The project will need to produce reports covering survey status and progress, whether in the form of documents and presentations. Many of the plots and metrics displayed in an information dashboard will be important elements in these reports. 

The intended audience and the frequency of reporting are both important feature to consider in determining how any given metric or plot is to be generated.
Possible audiences include the funding agencies, Rubin Observatory management, LSST science collaboration scientists, the Rubin Observatory observing scientists, the scheduler developers, astronomers working on other projects, other members of the astronomical community, and the general public. 
Plots and metrics may be generated on regular schedules (nightly, monthly, etc.), or as occasions demand.

The LSST system and data management requirements ([[https://ls.st/lse-29][LSE-29]] and [[https://ls.st/lse-61][LSE-61]]) and observatory systems specifications ([[https://ls.st/lse-30][LSE-30]]) include requirements on several reports and reporting tools, and additional reports or tools may also be required.

