body_text.org
** Published upcomming schedule
To support coordination between LSST observing and that of other projects, including schedling of simultaneous or nearly simultaneous exposures the same areas of sky, the requirments specify that Rubin Observatory publish the observing schedule in advance.


One requirement that specifies the advanced schedule is [[https://ls.st/lse-61][LST-61]]/DMS-REQ-0353, "Publishing predicted visit schedule":
#+begin_quote
Specification: A service shall be provided to publish to the community the next visit location and the predicted visit schedule provided by the OCS. This service shall consist of both a web page for human inspection and a web API to allow automated tools to respond promptly.

Discussion: The next visit and advanced schedule do not need to be published using the same service or protocol.
#+end_quote
another is [[https://ls.st/lse-30][LSE-30]]/OSS-REQ-0378, "Advanced Publishing of Scheduler Sequence":
#+begin_quote
The scheduling of the observing sequence lasting at least =schedSeqDuration= shall be published in advance of each observing visit.
#+end_quote

Schedule predictions will be useful for other purposes as well, even if they are only approximate.
Another user for which an advanced schedule will be important is the observing scientists on duty.
If observing scientists can review simulated schedules for an upcomming night, it will help them both identify some undesireable behaviour before it occurrs, and also help the identify when something is going wrong during observing itself.
Many factors influence the scheduling of exposures in detail, and it can be difficult for a human to distinguish desired from undesired behaviour.
If the observing scientists can review a handful of different simulations of the upcomming night, they can consult with scheduling experts to understand any apparantely anomolous behaviour.
Then, if the behaviour of the scheduler during the night is significanty different from any simulated scheduled nights produced the day before, the observatory scientists may know that the scheduling experts need to be consulted even if the scheduler behaviour is not obviously wrong.[fn:: Additionally, the simulations that support the schedule predictions can serve as an emergency back-up in case of a disasterous failure of the scheduler during the night: the observing scientist can take the simulated schedule that seems most suitable given current conditions, and run it as a script.]
** Night reports
Night reports (or nights summaries) are in important feature common to most astronomical facilities, and basic plots and metrics indicating survey progress are important elements for such reports in large surveys such as LSST.
Several Rubin Observatory requirements require the generation of night reports:
 - LSE-30/OSS-REQ-0131 :: Nightly Summary Products
 - LSE-30/OSS-REQ-0406 :: Subsystem Nightly Reporting
 - LSE-61/DMS-REQ-0096 :: Generate Data Quality Report Within Specified Time
 - LSE-61/DMS-REQ-0097 :: Level 1 Data Quality Report Definition
These specifications require that the report summarize "per system performance and behavior," but do not specify what is to be reported in great detail. LSE-61/DMS-REQ-0097, "Level 1 Data Quality Report Definition" has the most specificity:
#+begin_quote
The DMS shall produce a Level 1 Data Quality Report that contains indicators of data quality that result from running the DMS pipelines, including at least: Photometric zero point vs. time for each utilized filter; Sky brightness vs. time for each utilized filter; seeing vs. time for each utilized filter; PSF parameters vs. time for each utilized filter; detection efficiency for point sources vs. mag for each utilized filter.
#+end_quote

Several diagnostics will be of particulary important for monitoring the scheduler.
Some of these concern the scheduler itself, including distributions of slew angles, airmasses of exposures, time spent changing filters, and features that drive selection based on maintaing cadences.
In addition, performance indicators from several other subsystems are of great interest for scheduling purposes.
For example, scheduling simulations depend critically on slew times, filter change times, and a sky brightness model.
If the performance of the relavant systems (considering the "sky" a system) differs significantly from the scheduler's expectations, then the scheduler configuration will need to be updated, and perhaps reoptimized. 

*** Notes                                                          :noexport:
**** [[https://ls.st/lse-30][LSE-30]]/OSS-REQ-0131 Nightly Summary Products
 #+begin_quote
 The Level 1 Data Products shall include a variety of reports, generated every night, that summarize the scientific quality of the Level 1 data (SDQA metrics), and the associated Observatory performance and performance of the Data Management subsystem.
 #+end_quote
**** [[https://ls.st/lse-30][LSE-30]]/OSS-REQ-0406 Subsystem Nightly Reporting
 #+begin_quote
 The LSST principal subsystems shall produce a searchable -interactive nightly report(s), from information in the EFD, summarizing per subsystem performance and behavior over a user defined period of time (e.g. the previous 24 hours).
 #+end_quote
**** [[https://ls.st/lse-61][LSE-61]]/DMS-REQ-0096 Generate Data Quality Report Within Specified Time
 #+begin_quote
 The DMS shall generate a nightly Data Quality Report within time dqReportComplTime in both human-readable and machine-readable forms.
 #+end_quote
**** [[https://ls.st/lse-61][LSE-61]]/DMS-REQ-0097 Level 1 Data Quality Report Definition
 #+begin_quote
 The DMS shall produce a Level 1 Data Quality Report that contains indicators of data quality that result from running the DMS pipelines, including at least: Photometric zero point vs. time for each utilized filter; Sky brightness vs. time for each utilized filter; seeing vs. time for each utilized filter; PSF parameters vs. time for each utilized filter; detection efficiency for point sources vs. mag for each utilized filter.
 #+end_quote
**** [[https://ls.st/lse-61][LSE-61]]/DMS-REQ-0099 Level 1 Performance Report Definition
 #+begin_quote
 The DMS shall produce a Level 1 Performance Report that provides indicators of how the DMS has performed in processing the night's observations, including at least: number of observations successfully processed through each pipeline; number of observations for each pipeline that had recoverable failures (with a record of the failure type and recovery mechanism); number of observations for each pipeline that had unrecoverable failures; number of observations archived at each DMS Facility; number of observations satisfying the science criteria for each active science program.
 #+end_quote

** Weekly and monthly progress reports
Among other duties, the "LSST Operations Plan" (LPM-73) specifies (section 8.3.3) that staff in Chile has the following telescope scheduling related duties:
 - Tracking survey progress relative to the science requirements.
 - Optimizing the scheduled observations.
 - Balancing the observing schedule between survey operations, diagnostic activities, and
calibration.
Furthermore, that the staff in Chile
#+begin_quote
Use the Operations Simulator toolbox to measure progress against the survey plan. A written monthly progress report will be provided to Headquarters, and weekly updates will be tracked in Chile. Adjustments to the short term observing plan (choice of filters, relative priority of science programs, etc.) will be made in Chile. 
#+end_quote
*** Notes                                                          :noexport:
**** [[https://ls.st/lpm-73][LPM-73]]: LSST Operations Plan 
 section 8.3.3
 #+begin_quote
  - Tracking survey progress relative to the science requirements.
  - Optimizing the scheduled observations.
  - Balancing the observing schedule between survey operations, diagnostic activities, and calibration.
 #+end_quote

 #+begin_quote
 Use the Operations Simulator toolbox to measure progress against the
 survey plan. A written monthly progress report will be provided to
 Headquarters, and weekly updates will be tracked in Chile.
 Adjustments to the short term observing plan (choice of filters,
 relative priority of science programs, etc.)  will be made in Chile.
 If major changes to observing strategy appear to be required,
 Headquarters will ask the PST for recommendations.
 #+end_quote

