body_text.tex

\subsection{Periodic performance reviews}
\label{sec:orgfcf3503}
The observatory staff and scheduling team will need to report progress and strategic concerns to management, funding agencies, and the community as a whole.
These review may take the form of presentations (for example at the yearly Project and Community Workshop (PCW)) or written reports.
Current requirements as written acknoweldge the need for such reports, but do not significantly constrain their contents. 
\href{https://ls.st/lse-29}{LSE-29}/LSR-REQ-0065, "Survey performance reviews," states:
\begin{quote}
The Observatory shall have the ability to provide periodic status
reports on the progress of the survey to allow both operations staff
and the community to assess the survey progress.
\end{quote}
\href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0314, "Subsystem Performance Reporting", emphasizes the importance of comparison with baselines:
\begin{quote}
The LSST Observatory over the course of the 10-year survey shall monitor its performance with respect to its established baseline and report variances exceeding established thresholds.
\end{quote}
\href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0033, "Survey Planning and performance monitoring", calls out the need for reporting to the community at large:
\begin{quote}
The LSST shall provide the tools and administrative processes
necessary to monitor the progress of the ongoing survey, provide
reports on the progress of the survey, respond to feedback from the
science community, and evaluate the impact of changing science
priorities over the 10 year survey lifetime.

Discussion: It is expected that the performance of this task will
require the use of detailed survey simulations in order to evaluate
scheduling alternatives and optimize the future performance of the
survey.
\end{quote}

The reasonable contents of the reports will depend both on the venue and the state of the survey itself, and the reports themselves will require significant explanatory text and analysis: these reports are not a reasonable candidate for full automation.
However, many of the metrics and plots that will be contained in such reports are, and furthermore will usually be those already generated for Night reports (section \ref{sec:orgb633637}), weekly and monthly progress reports (section \ref{sec:org3b7fa8c}), or generated by dashboards or using interactive debugging tools.

\subsection{{\bfseries\sffamily ACTIVE} Tools for performance evaluation and analysis}
\label{sec:org6bee324}
In addition to reports, tools for monitoring performance ("dashboards") and interactive analysis are needed.
Some of the views of the data required will consist of simple values directly connected to data generated by the instrumentation of the observatory itself ("telemetry").
Such requirments include \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0067, "Performance \& Trend Analysis Toolkit":
\begin{quote}
The LSST system shall provide a common tool kit for conducting performance analysis, including trending, on the telemetry captured in the Engineering \& Facility Database.
\end{quote}
and  \href{https://ls.st/lse-29}{LSE-29}/LSR-REQ-0071 "Scientific Oversight During Data Collection":
\begin{quote}
Requirement: The LSST Observatory shall be developed to allow an
observing scientist to have oversight of the Data Collection
process. This interaction shall be enabled either locally on the
summit or at remote locations. The data provided shall include all
observing condition data, telemetry data to assess telescope
conditions, and science data quality metrics for evaluation of the
data collection process.

Discussion: The objective of this requirement is to enable the
observing scientist to be involved directly in the observing
process. Under normal circumstances the observing scientist will not
intervene in the autonomous operations (LSR-REQ-0072), but should be
allowed to override if anomalous behavior occurs.
\end{quote}

In other cases, the it is clear that tools that are limited to simple examinition of telemetry will not be sufficient.
For example, \href{https://ls.st/lse-29}{LSE-29}/LSR-REQ-0066, "Survey performance evaluation":
\begin{quote}
The Project shall create the necessary survey performance evaluation
tools to predict the final results of the ten year survey based on the
actual survey completed to date, assess the impacts of survey strategy
changes resulting from changes in scientific priorities, and support
the planning of the survey on a variety of time scales, from nightly
through the entire 10 year duration.
\end{quote}
and \href{https://ls.st/lse-29}{LSE-29}/LSR-REQ-0070, "Science Priorities and Survey Monitoring":
\begin{quote}
The LSST project shall monitor the scientific and technical progress
of the survey, communicate with the scientific user community and
establish survey priorities, and adjust the survey design as needed to
accomplish its goals given these priorities and achieved performance.
\end{quote}
recognize the need for tools that support generation and analysis of higher level diagnostics.

Numerous additional requirements recognize needs for monitoring and reporting, and most of them are of significant relevance to survey progress and strategy. These include:
\begin{itemize}
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0056 System Monitoring \& Diagnostics
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0063 System Monitoring \& Diagnostics Subsystem Metadata for Science Analysis
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0068 Summit Environment Monitoring
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0072 Weather and Meteorological Monitoring
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0078 Maintenance Reporting
\item \href{https://ls.st/lse-30}{LSE-30}/OSS-REQ-0079 Maintenance Tracking and Analysis
\end{itemize}

TODO discuss separation of telemetry and other metrics that need tools for exploration, and correspondance to LOVE and SQuaRE/SQuaSH, and implications for survey progress monitoring tool development.

\subsection{Interfaces for education and public outreach}
\label{sec:orge91762f}
While many survey progress metrics and visualizations are only likely to be of interest to experts, several will be intuitive, and may be good candidates for engaging the general public, as per \href{https://ls.st/lse-29}{LSE-29}/LSR-REQ-0113, "EPO Products, Tools, and Interfaces"
\begin{quote}
LSST EPO shall provide access to LSST data through tools, interfaces,
and learning experiences that are designedto engage communities with
different levels of knowledge, experience and skills.
\end{quote}
Good candidates for presentation to the public are movies of numbers of exposures generated, and plots numbers of galaxies (or other objects) detected as a function of time.
\section{Reports elements}
\label{sec:orgbb2408d}
\begin{itemize}
\item {\bfseries\sffamily TODO} baseline numbers of exposures vs. time
\label{sec:org1ab4bcf}
\begin{itemize}
\item By band
\label{sec:org940f7a2}
\item By RA bin
\label{sec:org147c5bd}
\end{itemize}
\item {\bfseries\sffamily TODO} teff vs time
\label{sec:org6d0693c}
\begin{itemize}
\item By band
\label{sec:org7e4cc06}
\item By RA bin
\label{sec:org74504d3}
\end{itemize}
\item {\bfseries\sffamily TODO} Aarea at depths vs. time
\label{sec:org25ed627}
\item {\bfseries\sffamily TODO} Area times time at cadence
\label{sec:org2eafea4}
\item {\bfseries\sffamily TODO} Total cadence maps
\label{sec:orgf9cc8c9}
Maps of area on which we have achieved a given cadence for a given time.
\item {\bfseries\sffamily TODO} Active cadence maps
\label{sec:org5402458}
\item {\bfseries\sffamily TODO} Current values of science metrics vs. time
\label{sec:org1d919b5}
\item {\bfseries\sffamily TODO} Extrapolated values of science metrics vs. time
\label{sec:orgb39e94f}
\item {\bfseries\sffamily TODO} Survey movies
\label{sec:org94e487d}
\begin{itemize}
\item Nightly
\label{sec:orgc855c47}
\item Long-term
\label{sec:orge8a98ba}
\end{itemize}
\item {\bfseries\sffamily TODO} Current area meeting cadence criteria
\label{sec:org2bae485}
\item {\bfseries\sffamily TODO} Numbers of objects detected by time, location, magnitude
\label{sec:org86bb3b0}
\item {\bfseries\sffamily TODO} Scheduler feature maps
\label{sec:orgec9c716}
\item {\bfseries\sffamily TODO} Downtime (by whether expected and by cause)
\label{sec:orgf1ad1d9}
\begin{itemize}
\item weather
\label{sec:orgc0677ad}
\item technical problems
\label{sec:orga2190e9}
\end{itemize}
