body_text.org
*** TODO Time spent on different programs (FWD, DDF, ToO, etc.)
*** TODO Overhead from instrument performance
**** slew time
**** filter change time
**** readout time
**** total efficiency (exposure time/night time)
*** TODO Slew angle distributions
*** TODO Airmass distribution vs. time
*** TODO Airmass distribution vs. location on sky
*** TODO Delivered seeing distribution
*** TODO Seeing achieved vs expected
*** TODO Sky brightness achieved vs expected
*** TODO Weather (clouds) achieved vs expected
*** TODO DDF cadence evaluation plots
*** TODO WFD cadence evaluation maps
*** TODO Accuracy of published next visit and advanced schedule information
*** TODO Number of filter changes
*** TODO Fraction of time scheduled in blobs
*** TODO Current season length maps
*** TODO Maximum gap in season maps
*** TODO Time since last observation maps
*** TODO Retrospective simulation
 If we simulated the time we just did, do we get what we actually got?
* Infrastructure needs
** TODO Data collection
*** Retrieving data from the EFD
*** Retrieving data from the DM butler
** TODO Data processing
*** Running opsim simulations
*** Running MAF metrics
** TODO Data storage?
** TODO Exploration tools
** TODO Dashboards
** TODO Report generation
* Available infrastructure
** TODO opsim
** TODO MAF
** TODO Engineering and Facilities Database (EFD)
- [[https://ls.st/LTS-210][LTS-210: Engineering and Facility Database Design Document]]
** TODO DM Butler
** TODO SQuaSH/SQuaRE
*** Overview diagram
*** [[https://sqr-009.lsst.io/][SQR-009: The SQuaSH metrics dashboard]]
*** [[https://sqr-017.lsst.io][SQR-017: Validation Metrics Framework]]
*** [[https://sqr-019.lsst.io/][SQR-019: LSST Verification Framework API Demonstration]]
*** [[https://sqr-023.lsst.io/][SQR-023: Design of the notebook-based report system]]
*** [[https://sqr-026.lsst.io/][SQR-026: Periodic report generation and publication via notebook templates]] 
**** night summaries
**** [[https://nbreport.lsst.io/][nbreport]] for automated reports
*** [[https://sqr-033.lsst.io/][SQR-033: QA Strategy Working Group recommendations for SQuaSH]]
*** [[https://sqr-034.lsst.io/][SQR-034: EFD Operations]]
*** nublado for interactive analysis
*** [[https://github.com/lsst-sqre/squash][SQuaSH github]]
** TODO faro
*** Notes here from discussions with Colin Slater of [2021-02-25 Thu]
*** Turns catalogs into scalar metrics
**** faro takes processed catalogs as input
**** combines and measures things in catalog space
***** photometrec repeatability
***** astrometric repeatabaility
***** other statistics
*** Operations on metric values 
**** Packages them
**** sends them to SQuaSH's  time series database
**** keeps track of how metrics change over time
**** based on assumption of a time series of scalars, not vectors, plots or other complex data structures
*** Currently used to keep track of pipeline code's progress
*** Generic infrastructure to convert catalogs to metrics, then store them.
*** Works on time series of single scalars that can be plotted as a function of time.
*** faro feeds the time series databes that feeds SQuaSH's influx DB
*** faro is a set of pipeline tasks that run in a gen3 task execution framework
*** metrics themselves are stored in the butler
*** much of what scheduling and survey progress would need would be in the EFD
**** not clear how to get data into the DM framework.
*** What is the right database for these derived quantities.
** TODO LOVE
*** https://lsst-ts.github.io/LOVE-integration-tools/html/index.html
*** [[https://lsst-ts.github.io/LOVE-integration-tools/html/modules/overview.html#love-architecture][Architecture diagram]] (section 1.2)
*** Communication consists of (from https://lsst-ts.github.io/LOVE-integration-tools/html/modules/overview.html)
**** telemetry
**** events (including "observing log events")
**** commands
**** command acknoweldgement
*** Telemetry collected of great interest to strategy and progress tracking, but usually too low level
* MAYBE Possible new work needed
** New plots and metrics
*** Lower level than science collaboration metrics, higher level than telemetry
** Infrastructure to run and analyze new simulations
*** Automated execution of opsim and MAF metric calculation
*** From tonight to the end of survey
*** For tonight under a variety of conditions
** Progress dashboard
*** Reference data (opsim inputs)
**** seeing model vs. achieved
**** cloud model vs. achieved
**** slew time
**** filter change time
*** Achieved progress
**** Plots and metrics generated by MAF
**** Currently achieved vs. expected metric values
**** Metric values extrapolated to end of survey
*** Maybe two? (LOVE and SQuaRE)
**** Not all metrics may be best calculated by the same infrastructure
** Report creating infrastructure
*** Night plans
*** Night reports
*** Weekly and/or monthly reports
