body_text.tex
\item {\bfseries\sffamily TODO} Time spent on different programs (FWD, DDF, ToO, etc.)
\label{sec:orgbb05c3c}
\item {\bfseries\sffamily TODO} Overhead from instrument performance
\label{sec:orgab8bbce}
\begin{itemize}
\item slew time
\label{sec:org5b3c420}
\item filter change time
\label{sec:orgefe47a6}
\item readout time
\label{sec:org0845348}
\item total efficiency (exposure time/night time)
\label{sec:org649c8e7}
\end{itemize}
\item {\bfseries\sffamily TODO} Slew angle distributions
\label{sec:org51eddb7}
\item {\bfseries\sffamily TODO} Airmass distribution vs. time
\label{sec:orga070e00}
\item {\bfseries\sffamily TODO} Airmass distribution vs. location on sky
\label{sec:org600e96c}
\item {\bfseries\sffamily TODO} Delivered seeing distribution
\label{sec:org5cd06d5}
\item {\bfseries\sffamily TODO} Seeing achieved vs expected
\label{sec:org0cb07fa}
\item {\bfseries\sffamily TODO} Sky brightness achieved vs expected
\label{sec:orgc76e539}
\item {\bfseries\sffamily TODO} Weather (clouds) achieved vs expected
\label{sec:org637106c}
\item {\bfseries\sffamily TODO} DDF cadence evaluation plots
\label{sec:org1577521}
\item {\bfseries\sffamily TODO} WFD cadence evaluation maps
\label{sec:org97902c3}
\item {\bfseries\sffamily TODO} Accuracy of published next visit and advanced schedule information
\label{sec:org907d96e}
\item {\bfseries\sffamily TODO} Number of filter changes
\label{sec:org1fbf7d3}
\item {\bfseries\sffamily TODO} Fraction of time scheduled in blobs
\label{sec:org21ec40c}
\item {\bfseries\sffamily TODO} Current season length maps
\label{sec:orge8f18a7}
\item {\bfseries\sffamily TODO} Maximum gap in season maps
\label{sec:org0c228b9}
\item {\bfseries\sffamily TODO} Time since last observation maps
\label{sec:org1cfd167}
\item {\bfseries\sffamily TODO} Retrospective simulation
\label{sec:org720f324}
If we simulated the time we just did, do we get what we actually got?
\end{itemize}
\section{Infrastructure needs}
\label{sec:org4b2538b}
\subsection{{\bfseries\sffamily TODO} Data collection}
\label{sec:org25835ba}
\begin{itemize}
\item Retrieving data from the EFD
\label{sec:org69332be}
\item Retrieving data from the DM butler
\label{sec:orgee794f9}
\end{itemize}
\subsection{{\bfseries\sffamily TODO} Data processing}
\label{sec:orgb26610d}
\begin{itemize}
\item Running opsim simulations
\label{sec:org1d272c8}
\item Running MAF metrics
\label{sec:orgb1b6d5a}
\end{itemize}
\subsection{{\bfseries\sffamily TODO} Data storage?}
\label{sec:orgbb6a35a}
\subsection{{\bfseries\sffamily TODO} Exploration tools}
\label{sec:org5c55241}
\subsection{{\bfseries\sffamily TODO} Dashboards}
\label{sec:org5e0d9fa}
\subsection{{\bfseries\sffamily TODO} Report generation}
\label{sec:org922b570}
\section{Available infrastructure}
\label{sec:org113a4d7}
\subsection{{\bfseries\sffamily TODO} opsim}
\label{sec:org0dabfef}
\subsection{{\bfseries\sffamily TODO} MAF}
\label{sec:org2897a29}
\subsection{{\bfseries\sffamily TODO} Engineering and Facilities Database (EFD)}
\label{sec:orgb8f9467}
\begin{itemize}
\item \href{https://ls.st/LTS-210}{LTS-210: Engineering and Facility Database Design Document}
\end{itemize}
\subsection{{\bfseries\sffamily TODO} DM Butler}
\label{sec:org3233a85}
\subsection{{\bfseries\sffamily TODO} SQuaSH/SQuaRE}
\label{sec:org79afcc3}
\begin{itemize}
\item Overview diagram
\label{sec:orgf7a6227}
\item \href{https://sqr-009.lsst.io/}{SQR-009: The SQuaSH metrics dashboard}
\label{sec:orgc2b5641}
\item \href{https://sqr-017.lsst.io}{SQR-017: Validation Metrics Framework}
\label{sec:org89e367e}
\item \href{https://sqr-019.lsst.io/}{SQR-019: LSST Verification Framework API Demonstration}
\label{sec:org5b8403f}
\item \href{https://sqr-023.lsst.io/}{SQR-023: Design of the notebook-based report system}
\label{sec:org4e954ad}
\item \href{https://sqr-026.lsst.io/}{SQR-026: Periodic report generation and publication via notebook templates}
\label{sec:orga84b076}
\begin{itemize}
\item night summaries
\label{sec:orgd5ea38b}
\item \href{https://nbreport.lsst.io/}{nbreport} for automated reports
\label{sec:orgb9bdb69}
\end{itemize}
\item \href{https://sqr-033.lsst.io/}{SQR-033: QA Strategy Working Group recommendations for SQuaSH}
\label{sec:orgf638a02}
\item \href{https://sqr-034.lsst.io/}{SQR-034: EFD Operations}
\label{sec:org2582b32}
\item nublado for interactive analysis
\label{sec:org351c734}
\item \href{https://github.com/lsst-sqre/squash}{SQuaSH github}
\label{sec:org1e55846}
\end{itemize}
\subsection{{\bfseries\sffamily TODO} faro}
\label{sec:org2391d0f}
\begin{itemize}
\item Notes here from discussions with Colin Slater of \textit{[2021-02-25 Thu]}
\label{sec:org66ae461}
\item Turns catalogs into scalar metrics
\label{sec:orgcd9f536}
\begin{itemize}
\item faro takes processed catalogs as input
\label{sec:org3f2a7e9}
\item combines and measures things in catalog space
\label{sec:orgc6afdb2}
\begin{itemize}
\item photometrec repeatability
\label{sec:org2691489}
\item astrometric repeatabaility
\label{sec:org6bde0e8}
\item other statistics
\label{sec:org399575f}
\end{itemize}
\end{itemize}
\item Operations on metric values
\label{sec:org3217314}
\begin{itemize}
\item Packages them
\label{sec:org3f7b077}
\item sends them to SQuaSH's  time series database
\label{sec:orgb861d99}
\item keeps track of how metrics change over time
\label{sec:org7c19111}
\item based on assumption of a time series of scalars, not vectors, plots or other complex data structures
\label{sec:org1e1dd61}
\end{itemize}
\item Currently used to keep track of pipeline code's progress
\label{sec:org0f93a65}
\item Generic infrastructure to convert catalogs to metrics, then store them.
\label{sec:org1e6b406}
\item Works on time series of single scalars that can be plotted as a function of time.
\label{sec:org5381a13}
\item faro feeds the time series databes that feeds SQuaSH's influx DB
\label{sec:org1baf0c7}
\item faro is a set of pipeline tasks that run in a gen3 task execution framework
\label{sec:org2dca0a6}
\item metrics themselves are stored in the butler
\label{sec:orgef94c5a}
\item much of what scheduling and survey progress would need would be in the EFD
\label{sec:orga2937da}
\begin{itemize}
\item not clear how to get data into the DM framework.
\label{sec:orgab1eb31}
\end{itemize}
\item What is the right database for these derived quantities.
\label{sec:orgb95210e}
\end{itemize}
\subsection{{\bfseries\sffamily TODO} LOVE}
\label{sec:orga8eed47}
\begin{itemize}
\item \url{https://lsst-ts.github.io/LOVE-integration-tools/html/index.html}
\label{sec:org3c11f91}
\item \href{https://lsst-ts.github.io/LOVE-integration-tools/html/modules/overview.html\#love-architecture}{Architecture diagram} (section 1.2)
\label{sec:orga667d4e}
\item Communication consists of (from \url{https://lsst-ts.github.io/LOVE-integration-tools/html/modules/overview.html})
\label{sec:orgb597787}
\begin{itemize}
\item telemetry
\label{sec:org74cf2b5}
\item events (including "observing log events")
\label{sec:orge4f559a}
\item commands
\label{sec:org506d4df}
\item command acknoweldgement
\label{sec:orgedc518a}
\end{itemize}
\item Telemetry collected of great interest to strategy and progress tracking, but usually too low level
\label{sec:org0d1f9c8}
\end{itemize}
\section{{\bfseries\sffamily MAYBE} Possible new work needed}
\label{sec:orgbbc9e6d}
\subsection{New plots and metrics}
\label{sec:org89c6b05}
\begin{itemize}
\item Lower level than science collaboration metrics, higher level than telemetry
\label{sec:org732b728}
\end{itemize}
\subsection{Infrastructure to run and analyze new simulations}
\label{sec:org88d6b1f}
\begin{itemize}
\item Automated execution of opsim and MAF metric calculation
\label{sec:org63adc37}
\item From tonight to the end of survey
\label{sec:org09ff629}
\item For tonight under a variety of conditions
\label{sec:org0631904}
\end{itemize}
\subsection{Progress dashboard}
\label{sec:orgd411e78}
\begin{itemize}
\item Reference data (opsim inputs)
\label{sec:orgf64686d}
\begin{itemize}
\item seeing model vs. achieved
\label{sec:org59af002}
\item cloud model vs. achieved
\label{sec:orgadb76a4}
\item slew time
\label{sec:org19160a9}
\item filter change time
\label{sec:org9bee779}
\end{itemize}
\item Achieved progress
\label{sec:org43da1d9}
\begin{itemize}
\item Plots and metrics generated by MAF
\label{sec:org4036ef5}
\item Currently achieved vs. expected metric values
\label{sec:org5f87a74}
\item Metric values extrapolated to end of survey
\label{sec:orgc1eaad8}
\end{itemize}
\item Maybe two? (LOVE and SQuaRE)
\label{sec:org5fca5bb}
\begin{itemize}
\item Not all metrics may be best calculated by the same infrastructure
\label{sec:orgb7ac0ff}
\end{itemize}
\end{itemize}
\subsection{Report creating infrastructure}
\label{sec:org27d46e9}
\begin{itemize}
\item Night plans
\label{sec:orgc9d8422}
\item Night reports
\label{sec:org19ce4fd}
\item Weekly and/or monthly reports
\label{sec:orgcef4f28}
\end{itemize}
